app/controllers/community_controller.rb

SELECT `specs`.* FROM `specs` WHERE (last_name like 'D%')  ORDER BY last_name, first_name
SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 328]]
---
  def index
    @title = "Community"
    @letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ".split("")
    if params[:id]
      @initial = params[:id]
      specs = Spec.where("last_name like ?","#{@initial}%").order("last_name, first_name")
      @users = specs.collect{|spec| spec.user}.paginate(:page => params[:page], :per_page => 5)

SELECT `users`.* FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31)
SELECT `specs`.* FROM `specs` WHERE `specs`.`id` IN (1, 9, 35, 74, 76, 84, 112, 176, 326, 343, 363, 372, 373, 404, 471, 62, 212, 83, 313)
---
  def search
    @title = "Search RailsSpace"
    if params[:q]
      query = params[:q]

      # First find the user hits ...
      search1 = User.search do
        fulltext query
      end
      @users = search1.results

      search2 = Spec.search do
        fulltext query
      end
      specs = search2.results

      search3 = Faq.search do
        fulltext query
      end
      faqs = search3.results

      # Now combine into one list of distinct users sorted by last name
      hits = specs + faqs
      @users.concat(hits.collect { |hit| hit.user }).uniq!
      @users.compact!
      # Sort by last name (requires a spec for each user)
      @users.each { |user| user.spec ||= Spec.new }