app/controllers/email_controller.rb

  def remind
    @title = "Mail me my login information"
    if param_posted?(:user)
      email = params[:user][:email]
      user = User.find_by_email(email)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = ? LIMIT 1  [["email", "sdsdsd@example.com"]]

  def correspond
    user = User.find(session[:user_id])
    session[:recipient] ||= params[:id]
    recipient = User.find_by_screen_name(session[:recipient])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 501]]
SELECT  `users`.* FROM `users` WHERE `users`.`screen_name` = ? LIMIT 1  [["screen_name", "ifunnell"]]