app/controllers/faq_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `faqs` SET `skills` = ?, `updated_at` = ? WHERE `faqs`.`id` = ?  [["skills", "Ruby on Rails, IOS, Android, JavaScript, Angular.JS"], ["updated_at", "2015-10-22 19:49:21"], ["id", 1]]
---
  def edit
    @title = "Edit FAQ"
    @user = User.find(session[:user_id])
    @user.faq ||= Faq.new
    @faq = @user.faq
    if param_posted?(:faq)
      if @user.faq.update_attributes(faq_params)