app/controllers/profile_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`screen_name` = ? LIMIT 1  [["screen_name", "cdondi"]]
SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 501]]
---
  def show
    @hide_edit_links = true
    screen_name = params[:screen_name]
    @user = User.find_by_screen_name(screen_name)
    @logged_in_user = User.find(session[:user_id]) if logged_in?