app/controllers/spec_controller.rb

UPDATE `specs` SET `first_name` = ?, `last_name` = ?, `occupation` = ?, `updated_at` = ? WHERE `specs`.`id` = ?  [["first_name", "new first name"], ["last_name", "new last name"], ["occupation", "new job"], ["updated_at", "2015-10-21 19:36:57"], ["id", 46361080]]
---
  def edit
    @title = "Edit Spec"
    @user = User.find(session[:user_id])
    @user.spec ||= Spec.new
    @spec = @user.spec
    if param_posted?(:spec)
      if @user.spec.update_attributes(spec_params)