app/controllers/spec_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `specs` SET `last_name` = ?, `gender` = ?, `occupation` = ?, `city` = ?, `state` = ?, `zip_code` = ?, `updated_at` = ? WHERE `specs`.`id` = ?  [["last_name", "Dondi"], ["gender", "Male"], ["occupation", "Ruby on Rails Developer"], ["city", "Houston"], ["state", "TX"], ["zip_code", "77074"], ["updated_at", "2015-10-21 19:18:54"], ["id", 1]]
---
  def edit
    @title = "Edit Spec"
    @user = User.find(session[:user_id])
    @user.spec ||= Spec.new
    @spec = @user.spec
    if param_posted?(:spec)
      if @user.spec.update_attributes(spec_params)