app/controllers/user_controller.rb

  def index
    @title = "RailsSpace User Hub"
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 5]]

  def edit
    @title = "Edit basic info"
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 5]]

  def register
    @title = "Register"
    if request.post? and user_params
      #logger.info "------------------ START USER PARAMS ----------------------"
      #logger.info user_params.inspect
      #logger.info "------------------    END USER PARAMS ----------------------"
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`screen_name`, `email`, `password`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["screen_name", "foobar"], ["email", "foo@domain.com"], ["password", "foobar"], ["created_at", "2015-10-03 23:19:44"], ["updated_at", "2015-10-03 23:19:44"]]

  def login
    @title = "Log in to RailsSpace"
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif request.post? and user_params
      @user = User.new(user_params)
      user = User.find_by(:screen_name => @user.screen_name, :password => @user.password)
---
SELECT  `users`.* FROM `users` WHERE `users`.`screen_name` = ? AND `users`.`password` = ? LIMIT 1  [["screen_name", "foobar"], ["password", "bazquux"]]