app/views/profile/_contact_box.html.erb

        <li><%= friendship_status(@logged_in_user, @user) %>
<% unless Friendship.exists?(@logged_in_user, @user) %>
---
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = ? AND `friendships`.`friend_id` = ? LIMIT 1  [["user_id", 501], ["friend_id", 372]]